modules/gateway/gateway-api/src/test/resources/com/l7tech/gateway/api/testMessages/Policy_PutDetails_Response.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
              xmlns:l7="http://ns.l7tech.com/2010/04/gateway-management"
              xmlns:mdo="http://schemas.wiseman.dev.java.net/metadata/messagetypes"
              xmlns:mex="http://schemas.xmlsoap.org/ws/2004/09/mex"
              xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
              xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing"
              xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration"
              xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
              xmlns:wsmeta="http://schemas.dmtf.org/wbem/wsman/1/wsman/version1.0.0.a/default-addressing-model.xsd"
              xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:xs="http://www.w3.org/2001/XMLSchema">
    <env:Header>
        <wsa:Action xmlns:ns11="http://ns.l7tech.com/2010/04/gateway-management" env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/PutResponse</wsa:Action>
        <wsman:FragmentTransfer Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116" env:mustUnderstand="true"
                                xmlns:l7="http://ns.l7tech.com/2010/04/gateway-management">l7:PolicyDetail</wsman:FragmentTransfer>
        <wsa:MessageID env:mustUnderstand="true">uuid:b1457b34-84f2-425a-ac9c-110473de352d</wsa:MessageID>
        <wsa:RelatesTo>uuid:1098bcee-0fc0-48fa-ae3d-099e4fcca4ed</wsa:RelatesTo>
        <wsa:To env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
    </env:Header>
    <env:Body xmlns:ns9="http://ns.l7tech.com/2010/04/gateway-management">
        <wsman:XmlFragment>
            <ns9:PolicyDetail guid="447a0133-5e33-43eb-a197-8a70e6e3d2f1" id="248872960" version="1" xmlns="">
                <ns9:Name>555</ns9:Name>
                <ns9:PolicyType>Include</ns9:PolicyType>
                <ns9:Properties>
                    <ns9:Property key="revision">
                        <ns9:LongValue>2</ns9:LongValue>
                    </ns9:Property>
                    <ns9:Property key="soap">
                        <ns9:BooleanValue>false</ns9:BooleanValue>
                    </ns9:Property>
                </ns9:Properties>
            </ns9:PolicyDetail>
        </wsman:XmlFragment>
    </env:Body>
</env:Envelope>